diet_dict = {
        0:'兔子絕對不可以只吃飼料，只吃飼料的兔子，因纖維質不足，營養過剩，會容易有過胖、脹氣、消化系統不健康、牙齒過長等的問題',
        1:'兔子也不可以都不餵飼料，因為家中的兔子只食用牧草，容易缺乏其他必要礦物質等維生素，必須透過飼料補充',
        2:'請注意不要給兔子吃鹽磚，吃飼料就已足夠，鹽分食用過量只會造成腎臟負擔喔',
        3:'幼兔建議5-6個月腸胃功能較健全後，再給他們吃些不同的蔬菜蔬果到日常飲食中較好哦', 
        4:'水果的部分，因為水果的水分、熱量、糖分都很高，只能當作點心零食少量就好',
        5:'兔子消化道脆弱，蔬果必須注意退冰、清洗乾淨並用冷開水沖過，避免直接食用到生水和農藥殘留',
        6:'兔兔可以吃的蔬菜包括油菜、青江菜、胡蘿蔔、花甘藍、荷蘭芹、芹菜、花椰菜、白蘿蔔的葉子、萵苣的葉子、地瓜、鴨兒芹等',
        7:'蔬菜類建議不要餵食地瓜葉或波菜，因草酸含量高，容易造成結石',
        8:'兔兔不可以吃的蔬菜包括馬鈴薯的芽與皮、大黃豆、洋蔥、蔥、韭菜、大蒜等',
        9:'兔兔可以吃的水果包括鳳梨、蘋果、哈密瓜、葡萄、草莓、香蕉、木瓜等',
        10:'兔兔不可以吃的水果包括酪梨、蘋婆，以及盡量避免高澱粉質的食物:紅蘿蔔、地瓜(番薯)、馬鈴薯、玉米、山藥、芋頭、五穀雜糧、堅果類、瓜子、青豆、豌豆 等豆類等容易引起脹氣等問題'
}

body_language_dict = {
        0:'用下巴磨東西:\n兔子下巴的位置有香腺，所以兔子會用下巴去擦東西，留下自己的氣味，以劃分地盤並表示這是屬於自己的東西',
        1:'後腳站立:\n通常會伴隨著警戒的神情，兔子兩眼睜大，耳朵豎直，全身緊繃。這是兔子察覺到危險的信號，初到陌生的地方時，兔子最常做出這種動作，一方面是不安，一方面也是偵查四周環境',
        2:'側睡:\n且把腿伸展是代表他們感到很安全，此時如果主人不去打擾他，兔子就很快就會睡著了哦',
        3:'身體壓低:\n代表他很緊張，覺得有危險接近。在野外，當兔子覺得有危險接近，他們會嘗試壓低身子，避免被看到。而寵物兔也會有這個行為',
        4:'母雞蹲:\n會整隻縮起來，把前腳塞在身體下，耳朵平平貼在頭上，眼睛半閉半睜。這是兔子基本的睡覺姿勢。因為它在野外屬於被獵食者，必須保持警戒，並且讓自已身體愈小愈好，這樣獵食者比較不容易發現牠們，所呈現的一種睡眠姿勢',
        5:'跳躍:\n當兔子感到非常高興時，會出現原地跳躍、在半空微微翻身的行為，有時候它還會邊跳躍邊擺頭。它們跳躍時就好像跳舞一樣，特別是迷你兔，它們非常喜歡用跳躍來表達高興和享受的感覺',
        6:'朝你低頭:\n當兔兔朝你低頭表示牠希望你可以摸摸牠的頭，討摸摸的動作',
        7:'推開主人的手:\n當兔兔推開主人的手，代表牠的拒絕，同時告訴你牠不需要囉',
        8:'輕咬:\n這是兔兔再暗示你，牠已經滿足了，想請你停下現在的動作哦',
        9:'噴尿:\n沒有結渣的成年公兔可能會出現噴尿的現象，而噴尿是兔子世界中用來劃分地盤和佔有母兔的做法，母兔可能同樣會有噴尿的行為，但公兔出現這種行為的情況比較多',
        10:'到處大便:\n如果兔子在不同地方拉大便，代表他正在劃地盤的行為唷',
        11:'拔自己的毛:\n母兔要產子的前一天，會出現拔毛的行為。兔子會在胸部和腳側的位置拔毛，利用拔出來的毛來建窩，給未來的小兔子保溫。但當兔子在假懷孕時，也會出現拔毛的情況。'
}

trivia_dict = {
        0:'世界紀錄中最大隻的兔子:\n目前世界紀錄中最大隻的兔子是英國布羅姆斯格羅夫小鎮的 Darius，重達 22 公斤，身長 130 公分左右品種為大陸巨兔。他平時的食量非常巨大，每年會吃掉4000美元(將近台幣11萬3000元)的食物。因為長得實在是太大，就連家裡養的寵物狗見到他都會害怕，是不是很有趣呢',
        1:'吃自己的糞便:\n兔兔有個怪習性，就是他們會吃自己的糞便。因為兔子要消化大量植物纖維，消化系統約佔身體重量的 10 ~ 20%。其中，螺旋形盲腸特別發達，容量佔整個消化道的一半。特殊的消化系統讓兔子糞便分為：硬硬圓圓的普通便；跟深色柔軟的「盲腸便」。盲腸便含有蛋白質、維生素、跟益菌，吃下肚能再一次被吸收利用，如此雙重消化能幫助兔子自己獲取最多的營養',
        2:'兔子1分鐘可以嚼至少120下:\n由於兔子的牙齒會不斷生長，牠們必須靠不斷咬嚙來將牙齒磨短，以保持健康狀態',
        3:'兔子都吃胡蘿蔔:\n卡通裡面的兔子們總是三餐都吃胡蘿蔔，但是在野外，兔子其實不主動吃根莖類的植物。且胡蘿蔔含糖量太高，容易導致兔子蛀牙，因此飼主們也不應該常常餵食胡蘿蔔',
        4:'兔子視力範圍:\n兔子的眼睛長在頭部左右兩側，就算牠們看著前方，也能看到周圍360度的人事物，因此你很難從背後偷偷靠近他們',
        5:'「活埋」小孩:\n野生母兔有時會把小孩埋進坑洞裡，在上頭來回跳個1、2次，覓食回來後才會翻開坑洞餵食。這個行為主要是保護孩子，避免牠們被天敵吃掉',
        6:'聽得懂人話:\n兔子其實知道自己的名字，當飼主叫他過來時他聽得懂，也會認主人以及分辨自己喜歡的人事物哦',
        7:'狡兔三窟:\n兔子能夠挖出複雜的地下系統，也被稱作兔穴，連接著專門用來睡覺和築巢的房間。且洞裡有多個出口，可以讓兔子在緊急情況下逃跑，充分驗證了狡兔三窟呢',
        8:'兔耳朵不能抓:\n很多傳統魔術表演都會有兔子，魔術師會用手拉兔子耳朵把牠們抓出來，但其實這個動作極為殘忍，會對兔子造成極大痛苦，應該抵制這樣的行為',
        9:'兔子不會嘔吐:\n兔子的消化系統不能反向運動，因此兔子處理吞咽的毛髮並不是吐出毛球，而是吃大量的草，通過草的纖維將毛髮推向它們的消化道，然後排出。這也顯示了兔子吃草的重要性',
        10:'兔子舞:\n指兔子會跳到半空中翻滾、甩動，這其實是他們表示他們現在非常快樂的方式哦'
}